---
kind: method
id: M:Autodesk.Revit.DB.InternalOrigin.Get(Autodesk.Revit.DB.Document)
source: html/ed465108-9467-3e78-8da4-8cdaa56e16cf.htm
---
# Autodesk.Revit.DB.InternalOrigin.Get Method

Gets the internal origin for the document.

## Syntax (C#)
```csharp
public static InternalOrigin Get(
	Document document
)
```

## Parameters
- **document** (`Autodesk.Revit.DB.Document`) - Revit document from which to get the internal origin.

## Returns
The internal origin of the document.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null